Revit 2027 API
HostedSweep.VerticalFlipped Property
Retrieve the vertical flip status of the hosted sweep object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool VerticalFlipped { get; }
Public ReadOnly Property VerticalFlipped As Boolean
	Get
public:
property bool VerticalFlipped {
	bool get ();
}
member VerticalFlipped : bool with get
Property Value
Boolean
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace